import pandas as pd
# 打开【成绩单.xlsx】工作簿，并获取【1 班】工作表的数据
data_1 = pd.read_excel('工作/工作/成绩单.xlsx', sheet_name='1 班')
print(data_1)


# 创建一个 DataFrame 对象的数据
data_2 = pd.DataFrame({'学号':[1, 2, 3], '性别':['男', '男', '女'], '年龄':['17', '17', '16'], '总分':['285', '273', '240']})
data_2

# 将数据写入到【新成绩单.xlsx】工作簿中的【2 班】工作表
data_2.to_excel('新成绩单.xlsx', sheet_name='2 班', index=False)


# 创建一个 DataFrame 对象的数据
data_5 = pd.DataFrame({'姓名':['林某某', '许放羊', '王鱼'], '语文': [87, 82, 67], '数学':[73, 85, 90], '英语':['89', '95', '95']})
data_5


# 计算每个人三门科目的总分
data_5['总分'] = data_5['语文'] + data_5['数学'] + data_5['英语'].astype(int)
print(data_5)



# 创建一个 DataFrame 对象的数据
data_7 = pd.DataFrame({'性别':['难', '女', '难', '女', '女'],
                       '城市':['.', '潮州市', '山头市', '汕尾市', '山头市'],
                       '年龄':[25, 26, 24, 25, 26],
                       '爱好':['蓝球', '跑步', '跳舞', '逛街', '读书']})
data_7


# 定义字典 fix_typo
fix_typo = {'山头市':'汕头市', '蓝球':'篮球'}
# 对【城市】列的错字进行修改
data_7['城市'] = data_7['城市'].replace(fix_typo)
data_7



# 创建一个 DataFrame 对象的数据
data_7 = pd.DataFrame({'性别':['难', '女', '难', '女', '女'],
                       '城市':['.', '潮州市', '山头市', '汕尾市', '山头市'],
                       '年龄':[25, 26, 24, 25, 26],
                       '爱好':['蓝球', '跑步', '跳舞', '逛街', '读书']})
data_7


# 定义字典 fix_typo
fix_typo = {'山头市':'汕头市', '蓝球':'篮球'}
# 对【城市】、【爱好】列的错字进行修改
data_7 = data_7.replace(fix_typo)
data_7

# 将【性别】列的“难”替换为“男”，【城市】列的“.”替换为“未知”
rep={'难':'男','.':'未知','山头市':'汕头市', '蓝球':'篮球'}
data_7=data_7.replace(rep)
data_7


