# 导入 pandas 库
import pandas as pd

# 书籍的部分销售数据
df_3 = pd.DataFrame({
    '书名': ['狂人日记', '活着', '狂人日记', '格林童话', '活着', '格林童话', '周易', '论语', '活着', '论语', '狂人日记', '周易'],
    '销售金额': [30, 50, 90, 40, 25, 60, 50, 120, 25, 40, 60, 50],
    '数量': [1, 2, 3, 2, 1, 3, 1, 3, 1, 1, 2, 1]
})

# 通过书名找到对应行的数据
df_3 = df_3.groupby(by='书名', as_index=True).sum().loc[['周易', '论语']]

# 查看数据
df_3



# 某男子私立大学三名延毕学生数据
df_4 = pd.DataFrame({'姓名': ['零某某', '徐放牛', '文学'],
                    '性别': ['男', '女', '女'],
                    '专业': ['生物信息', '人工智能', '文学'],
                    '挂科次数': ['7', '5', '4'],
                    '旷课次数': [45, 44, 30]})
 
# 新建一个总次数列来计算挂科次数和旷课次数的和
df_4['总次数'] = df_4['挂科次数'].astype(int) + df_4['旷课次数']

# 查看数据
df_4




# 某男子私立大学三名延毕学生数据
df_5 = pd.DataFrame({'姓名': ['零某某', '徐放牛', '文学'],
                    '性别': ['男', '女', '女'],
                    '专业': ['生物信息', '人工智能', '文学'],
                    '挂科次数': ['7', '5', '4'],
                    '旷课次数': [45, 44, 30],
                    '总次数': [52, 49, 34]})

# 第一种方式：对所有列的指定数据进行批量替换
data_1 = df_5.replace({'女': '男', '文学': '电子竞技'})

# 第二种方式：对指定列的指定数据进行批量替换
data_2 = df_5
# 替换性别
data_2['性别'] = data_2['性别'].replace({'女': '男'})
# 替换专业
data_2['专业'] = data_2['专业'].replace({'文学': '电子竞技'})

# 打印结果
print(data_1)
print(data_2)

# 某男子私立大学三名延毕学生数据
df_6 = pd.DataFrame({'姓名': ['零某某', '徐放牛', '文学'],
                    '性别': ['男', '男', '男'],
                    '专业': ['生物信息', '人工智能', '电子竞技'],
                    '挂科次数': ['7', '5', '4'],
                    '旷课次数': [45, 44, 30],
                    '总次数': [52, 49, 34]})
                        
# 把总次数大于50次的值换成“开除”，其他的换成“延毕”
df_6['总次数'] = df_6['总次数'].replace({52: '开除', 49: '延毕', 34: '延毕'})

# 查看数据
df_6



# 某男子私立大学三名延毕学生数据
df_7 = pd.DataFrame({'姓名': ['零某某', '徐放牛', '文学'],
                    '性别': ['男', '男', '男'],
                    '专业': ['生物信息', '人工智能', '电子竞技'],
                    '挂科次数': ['7', '5', '4'],
                    '旷课次数': [45, 44, 30],
                    '总次数': [52, 49, 34]})

# 先定义一个函数
def map_judge(x):
    if x >= 50:
        return "开除"
    else:
        return "延毕"

# 将函数 map_judge 作为参数传入 df.map()
df_7['总次数'] = df_7['总次数'].map(map_judge)

# 查看数据
df_7


# 某男子私立大学三名延毕学生数据
df_8 = pd.DataFrame({'姓名': ['零某某', '徐放牛', '文学'],
                    '性别': ['男', '男', '男'],
                    '专业': ['生物信息', '人工智能', '电子竞技'],
                    '挂科次数': ['7', '5', '4'],
                    '旷课次数': [45, 44, 30],
                    '总次数': ['开除', '延毕', '延毕']})

# 先定义一个函数
def map_amount(x):
    if x >= 40:
        return '多'
    else:
        return '少'

# 将函数作为参数传入df.map()
df_8['旷课次数'] = df_8['旷课次数'].agg(map_amount)

# 查看数据
df_8