# 导入 pandas 库
import pandas as pd

# 部分唐朝诗人数据
df_1 = pd.DataFrame({'诗人': ['白居易', '李白', '杜甫', '王勃', '王维'],
                    '称号': ['诗魔', '诗仙', '诗圣', '诗杰', '诗佛'],
                    '年龄': [74, 61, 58, 26, 60],
                    '诗歌大致数量': [3000, 900, 1500, 80, 400]})

# 按诗人的诗歌大致数量从高到低进行排序        
df_1.sort_values(by='诗歌大致数量', ascending=False)

# 部分唐朝诗人数据
df_2 = pd.DataFrame({'诗人': ['白居易', '李白', '杜甫', '王勃', '王维'],
                    '称号': ['诗魔', '诗仙', '诗圣', '诗杰', '诗佛'],
                    '年龄': [74, 61, 58, 26, 60],
                    '诗歌大致数量': [3000, 900, 1500, 80, 400]})

# 按诗人的诗歌大致数量从高到低进行排序并重置行索引
df_2 = df_2.sort_values(by='诗歌大致数量', ascending=False).reset_index(drop=True)

# 查看数据
df_2


# 部分唐朝诗人数据
df_3 = pd.DataFrame({'诗人': ['白居易', '李白', '杜甫', '王勃', '王维'],
                    '称号': ['诗魔', '诗仙', '诗圣', '诗杰', '诗佛'],
                    '年龄': [74, 61, 58, 26, 60],
                    '诗歌大致数量': [3000, 900, 1500, 80, 400]})

# 按诗人的诗歌大致数量从高到低进行排序并重置行索引
df_3 = df_3.sort_values(by='诗歌大致数量', ascending=False, ignore_index=True)

# 查看数据
df_3


# 部分唐朝诗人数据
df_4 = pd.DataFrame({'诗人': ['白居易', '李白', '杜甫', '王勃', '王维'],
                    '称号': ['诗魔', '诗仙', '诗圣', '诗杰', '诗佛'],
                    '年龄': [74, 61, 58, 26, 60],
                    '诗歌大致数量': [3000, 900, 1500, 80, 400]})

# 按诗人的诗歌大致数量从高到低进行排序并重置行索引
df_4 = df_4.sort_values(by='诗歌大致数量', ascending=False).reset_index(drop=True)

# 按诗人的年龄从高到低进行排序，重置行索引并将混乱的行索引保留成新的一列
df_4 = df_4.sort_values(by='年龄', ascending=False).reset_index(drop=False)

# 查看数据
df_4

# 带有重复行的部分唐朝诗人数据
df_5 = pd.DataFrame({'诗人': ['白居易', '李白', '杜甫', '王勃', '王勃', '王维'],
                    '称号': ['诗魔', '诗仙', '诗圣', '诗杰', '诗杰', '诗佛'],
                    '年龄': [74, 61, 58, 26, 26, 60],
                    '诗歌大致数量': [3000, 900, 1500, 80, 80, 400]})

# 使用 drop_duplicates() 方法删除重复行并用 ignore_index 参数重置行索引
df_5 = df_5.drop_duplicates(ignore_index =True)